In [1]:
#importing necessary libaries.
import pandas as pd
import numpy as np

In [2]:
#importing dataset
df_basobas=pd.read_csv('basobas_raw.csv')

In [3]:
df_basobas.sample(5)

,price,location,area,facing,no_of_bedroom,no_of_bathroom,no_of_livingroom,no_of_kitchen,parking,road_size,furniture,floors
151,37000000,Sitapaila Aadheshwor 5,5 Ana,East,5.0,2.0,1.0,3.5,2.0,13.0,Semi Furnished,3.5
201,35000000,Imadol Tempo Park,0-3-1-0,North,6.0,4.0,2.0,3.0,5.0,13.0,Semi Furnished,3.0
169,39500000,"Shital height, Imadol",0-4-2-0,West,7.0,6.0,2.0,3.0,5.0,13.0,Full Furnished,3.0
66,35000000,Jala binayak colony,0-5-2-0,South,5.0,3.0,1.0,2.5,3.0,20.0,Full Furnished,2.5
98,34500000,Near Down Town Residency,0-3-2-0,North,5.0,4.0,2.0,3.0,3.0,16.0,Semi Furnished,3.0

In [4]:
df_basobas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 286 entries, 0 to 285
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   price             286 non-null    int64
 1   location          286 non-null    object
 2   area              273 non-null    object
 3   facing            286 non-null    object
 4   no_of_bedroom     279 non-null    float64
 5   no_of_bathroom    281 non-null    float64
 6   no_of_livingroom  280 non-null    float64
 7   no_of_kitchen     281 non-null    float64
 8   parking           280 non-null    float64
 9   road_size         223 non-null    float64
 10  furniture         285 non-null    object
 11  floors            281 non-null    float64
dtypes: float64(7), int64(1), object(4)
memory usage: 26.9+ KB

In [5]:
df_basobas.isnull().sum()

price                0
location             0
area                13
facing               0
no_of_bedroom        7
no_of_bathroom       5
no_of_livingroom     6
no_of_kitchen        5
parking              6
road_size           63
furniture            1
floors               5
dtype: int64

In [6]:
#filling up the less necessay data with their mode.
df_basobas['road_size']=df_basobas['road_size'].fillna(df_basobas['road_size'].mode())
df_basobas['furniture']=df_basobas['furniture'].fillna(df_basobas['furniture'].mode()[0])

In [7]:
#rest of data looks like are more import so nan values will affect our result so dropiing those rows.
df_basobas=df_basobas.dropna()

In [8]:
df_basobas.isnull().sum()

price               0
location            0
area                0
facing              0
no_of_bedroom       0
no_of_bathroom      0
no_of_livingroom    0
no_of_kitchen       0
parking             0
road_size           0
furniture           0
floors              0
dtype: int64

In [9]:
df_basobas.info()

<class 'pandas.core.frame.DataFrame'>
Index: 219 entries, 0 to 285
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   price             219 non-null    int64
 1   location          219 non-null    object
 2   area              219 non-null    object
 3   facing            219 non-null    object
 4   no_of_bedroom     219 non-null    float64
 5   no_of_bathroom    219 non-null    float64
 6   no_of_livingroom  219 non-null    float64
 7   no_of_kitchen     219 non-null    float64
 8   parking           219 non-null    float64
 9   road_size         219 non-null    float64
 10  furniture         219 non-null    object
 11  floors            219 non-null    float64
dtypes: float64(7), int64(1), object(4)
memory usage: 22.2+ KB

In [13]:
# Conversion factors (approximate)
ropani_to_sqft = 5476
aana_to_sqft = 42.253
paisa_to_sqft = 85.56
daam_to_sqft = 21.39

def convert_to_sqft(measurement):
    """Converts a Nepali land measurement to square feet.

    Args:
        measurement: A string representing the Nepali land measurement.

    Returns:
        The equivalent measurement in square feet, or None if the measurement is invalid.
    """

    # Handle numerical values directly
    try:
        return float(measurement)
    except ValueError:
        pass

    # Handle Nepali units
    measurement = measurement.lower()
    if 'ropani' in measurement:
        try:
            return float(measurement.split(' ')[0]) * ropani_to_sqft
        except ValueError:
            pass
    elif 'aana' in measurement:
        try:
            return float(measurement.split(' ')[0]) * aana_to_sqft
        except ValueError:
            pass
    elif 'paisa' in measurement:
        try:
            return float(measurement.split(' ')[0]) * paisa_to_sqft
        except ValueError:
            pass
    elif 'poisa' in measurement:
        try:
            return float(measurement.split(' ')[0]) * paisa_to_sqft
        except ValueError:
            pass
    elif 'daam' in measurement:
        try:
            return float(measurement.split(' ')[0]) * daam_to_sqft
        except ValueError:
            pass
    elif 'sqft' in measurement:
        try:
            return float(measurement.split(' ')[0])
        except ValueError:
            pass
    elif 'sq ft' in measurement:
        try:
            return float(measurement.split(' ')[0])
        except ValueError:
            pass     
    elif '-' in measurement:
        # Handle '0-3-3-0' format
        parts = measurement.split('-')
        if len(parts) == 4:
            ropani, aana, paisa, daam = map(float, parts)
            return ropani * ropani_to_sqft + aana * aana_to_sqft + paisa * paisa_to_sqft + daam * daam_to_sqft
        else:
            return None

    # Handle invalid measurements
    return None

# Sample data
 # Replace with your actual data
data=df_basobas['area']
# Convert to square feet
results = []
for measurement in data:
    sqft = convert_to_sqft(measurement)
    results.append(sqft)

In [16]:
df_basobas['area']=df_basobas['area'].apply(convert_to_sqft)

In [17]:
df_basobas.head()

,price,location,area,facing,no_of_bedroom,no_of_bathroom,no_of_livingroom,no_of_kitchen,parking,road_size,furniture,floors
0,32000000,"Shital height, Imadol",169.539,East,5.0,4.0,2.0,3.0,4.0,13.0,Semi Furnished,3.0
1,28000000,Shital Height,126.759,West,5.0,4.0,2.0,3.5,2.0,13.0,Semi Furnished,3.5
5,40000000,"Shital height, Imadol",169.012,North,6.0,4.0,2.0,2.5,4.0,13.0,Full Furnished,2.5
6,28000000,Bhaisepati,169.012,South,6.0,3.0,2.0,2.5,4.0,16.0,Full Furnished,2.5
7,40000000,Harisiddhi,295.771,East,6.0,4.0,2.0,2.5,4.0,13.0,Full Furnished,2.5

In [19]:
df_basobas.to_csv('processed_data_basobas.csv',index=False)